{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "## Radix sort (цифровая сортировка)"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[0, 1, 2, 2, 3, 4, 4, 5, 7, 7]\n",
      "[0, 1, 1, 3, 3, 3, 6, 6, 6, 7]\n",
      "[0, 0, 2, 2, 3, 4, 4, 4, 6, 6]\n",
      "100 123 321 456 754 757 987\n"
     ]
    }
   ],
   "source": [
    "LEN_DICT = 10 # m\n",
    "DICT_BEGIN = ord('0')\n",
    "\n",
    "O(k(2 * n + m)) = O(2kn + mk) ~ O(k * n)\n",
    "O(n + 2 * m) ~ O(n)\n",
    "\n",
    "def radix_sort(a: list):\n",
    "    b = a.copy()\n",
    "    for i in range(k): # k\n",
    "        cnt = [0] * LEN_DICT\n",
    "        for elem in b: # n\n",
    "            cnt[ord(elem[k - i - 1]) - DICT_BEGIN] += 1\n",
    "        p = [0] * LEN_DICT\n",
    "        for j in range(1, LEN_DICT): # m\n",
    "            p[j] = cnt[j - 1] + p[j - 1]\n",
    "        print(p)\n",
    "        for elem in b.copy(): # n\n",
    "            b[p[ord(elem[k - i - 1]) - DICT_BEGIN]] = elem\n",
    "            p[ord(elem[k - i - 1]) - DICT_BEGIN] += 1\n",
    "    return b\n",
    "\n",
    "\n",
    "k = 3\n",
    "a = ['123', '321', '456', '987', '757', '754', '100']\n",
    "a = radix_sort(a)\n",
    "print(*a)"
   ]
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Задача\n",
    "\n",
    "У нерушимого города-государства Иннолэнд богатая история. Множество королей правило на этой земле в течение многих веков. Город гордится своими предводителями, поэтому его жители хотят выбить имя каждого из королей на особой плите в самом центре города (дабы заполнить хоть чем-то пустующий и безлюдный город).\n",
    "\n",
    "У каждого короля Иннолэнда помимо имени имеется порядковый номер. Этот номер записан в римской системе счисления рядом с именем каждого короля великого города-государства. Например, Louis XIII был тринадцатым королем Иннолэнда, имеющим имя Louis (ох уж эти иннолэндовцы и их имена...).\n",
    "\n",
    "Однако не все так просто устроено в этом городе. Жители Иннолэнда любят соблюдать порядок во всем, поэтому должен соблюдаться и порядок имен на плите. Важно, чтобы имена на плите были упорядочены в лексикографическом порядке. Однако некоторые короли могли иметь одно и то же имя, поэтому короли с одинаковым именем они должны быть отсортированы в соответствии с их порядковыми номерами. Например, славный король Louis IX должен быть указан на плите после доблестного короля Louis VIII.\n",
    "\n",
    "Жители Иннолэнда пока ещё плохо ладят с упорядочиванием имен и уж тем более с компьютерами, поэтому они обратились за помощью к Вам — Вы-то уже давно хорошо знакомы с этими вещами. Они передали список имен всех королей, а Вы должны вернуть им тот же список, но имена в нем должны идти уже в нужном порядке: в желаемом списке раньше записаны те короли, у которых имя лексикографически меньше, а среди королей с одинаковым именем раньше идут те, у которых меньше порядковый номер.\n",
    "\n",
    "#### Входные данные\n",
    "В первой строке записано число $n$ (1≤$n$≤50) — количество королей.\n",
    "\n",
    "В следующих $n$ строках записаны имена и порядковые номера королей. В каждой строке сначала записано имя короля, состоящее из не более чем 20 латинских букв (первая буква имени прописная, все последующие строчные), а затем через пробел записан его порядковый номер в виде римского числа от 1 до 50.\n",
    "\n",
    "#### Выходные данные\n",
    "В $n$ строках должны быть записаны имена и порядковые числа королей, упорядоченные необходимым образом.\n",
    "\n",
    "\n",
    "```\n",
    "2\n",
    "Louis IX\n",
    "Louis VIII\n",
    "```\n",
    "```\n",
    "Louis VIII\n",
    "Louis IX\n",
    "```\n",
    "\n",
    "#### Примечание\n",
    "* Числа от 1 до 10 обозначаются с помощью римских цифр как I, II, III, IV, V, VI, VII, VIII, IX и X соответственно;\n",
    "* Числа 20, 30, 40 и 50 обозначаются как XX, XXX, XL и L соответственно;\n",
    "* Остальные двузначные числа меньшие 50 в римской записи могут быть получены путем конкатенации римской записи десятков и римской записи единиц этого числа. Например, 47 = 40 + 7 = XL + VII = XLVII."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Задача\n",
    "\n",
    "Мальчик Антон решает вступительную работу в летний математический лагерь. В ней $N$ заданий, которые можно выполнять в произвольном порядке. Разные задачи требуют разного времени для решения. При этом известно, что если задание с номером $i$\n",
    " выполнять $j$-м по счету, Антону потребуется $T_i * j$ времени: чем больше думаешь, тем больше устаешь. Например, если начать с первой задачи, а затем выполнить вторую, то потребуется $T_1 * 1 + T_2 * 2$ времени, а если выполнить сначала вторую задачу, а затем первую – то $T_2 * 1 + T_1 * 2$. Подскажите Антону, в каком порядке нужно решать задачи, чтобы на выполнение всей работы ушло как можно меньше времени.\n",
    "\n",
    "#### Входные данные\n",
    "В первой строке вводится число $N$, во второй строке — $N$ чисел через пробел $T_1, T_2, …, T_N$, разделенные пробелами. Все числа целые и удовлетворяют следующим ограничениям: 0 < $N$ ≤ 10, 0 < $T_I$ ≤ 100.\n",
    "\n",
    "#### Выходные данные\n",
    "Требуется вывести сначала минимальное время, за которое можно решить все задачи, а затем – номера задач в том порядке, в котором их нужно решать, чтобы уложиться в это время. Все числа разделяются пробелами. Если решений несколько, нужно выдать любое из них."
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false,
    "pycharm": {
     "is_executing": true
    }
   }
  },
  {
   "cell_type": "markdown",
   "source": [
    "### Задача\n",
    "\n",
    "В обувном магазине продается обувь разного размера. Известно, что одну пару обуви можно надеть на другую, если она хотя бы на три размера больше. В магазин пришел покупатель. Требуется определить, какое наибольшее количество пар обуви сможет предложить ему продавец так, чтобы он смог надеть их все одновременно.\n",
    "\n",
    "#### Входные данные\n",
    "Сначала вводится размер ноги покупателя (обувь меньшего размера он надеть не сможет), затем количество пар обуви в магазине и размер каждой пары. Размер — натуральное число, не превосходящее 100, количество пар обуви в магазине не превосходит 1000.\n",
    "\n",
    "#### Выходные данные\n",
    "Выведите единственное число — максимальное количество пар обуви.\n",
    "\n",
    "\n",
    "```\n",
    "26\n",
    "5\n",
    "30 35 40 41 42\n",
    "```\n",
    "```\n",
    "3\n",
    "```\n",
    "\n"
   ],
   "metadata": {
    "collapsed": false
   }
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "outputs": [],
   "source": [],
   "metadata": {
    "collapsed": false
   }
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
